src/Documents/ТехническийПроект/ТехническийПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТехническийПроект</name>
  <attributes>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Конфигурации</name>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Изменения</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияСОбъектами</types>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>CatalogRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ОбъектыМетаданных</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВладелец</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Платформа</name>
      <type>
        <types>CatalogRef.Платформы</types>
      </type>
    </attributes>
    <attributes>
      <name>НетИзмененийМетаданных</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОбъекта</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
        <types>ChartOfCharacteristicTypesRef.ВопросыАнкетОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаПрав</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Удалить_Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>CatalogRef.ИзмененияМатрицыПрав</types>
      </type>
    </attributes>
    <attributes>
      <name>Право</name>
      <type>
        <types>CatalogRef.Права</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ТехническийПроект/ManagerModule.bsl
Функция СформироватьHtmlОписание(ДокументСсылкаТехПроект) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехническийПроект.Номер КАК Номер,
	               |	ТехническийПроект.Дата КАК Дата,
	               |	ТехническийПроект.Описание КАК Описание,
	               |	ТехническийПроект.Ответственный КАК Ответственный
	               |ИЗ
	               |	Документ.ТехническийПроект КАК ТехническийПроект
	               |ГДЕ
	               |	ТехническийПроект.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехническийПроектКонфигурации.Конфигурация КАК Конфигурация,
	               |	ТехническийПроектКонфигурации.Конфигурация.Наименование КАК КонфигурацияНаименование
	               |ИЗ
	               |	Документ.ТехническийПроект.Конфигурации КАК ТехническийПроектКонфигурации
	               |ГДЕ
	               |	ТехническийПроектКонфигурации.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехническийПроектИзменения.Действие.Наименование КАК Действие,
	               |	ТехническийПроектИзменения.Конфигурация.Наименование КАК Конфигурация,
	               |	ЕСТЬNULL(ТехническийПроектИзменения.ТипОбъекта.Наименование, """") КАК ТипОбъекта,
	               |	ВЫБОР
	               |		КОГДА ТехническийПроектИзменения.Объект ССЫЛКА Справочник.ОбъектыМетаданных
	               |			ТОГДА ЕСТЬNULL(ТехническийПроектИзменения.Объект.Наименование, """")
	               |		ИНАЧЕ ТехническийПроектИзменения.Объект
	               |	КОНЕЦ КАК Объект,
	               |	ТехническийПроектИзменения.ОбъектВладелец КАК ОбъектВладелец,
	               |	ТехническийПроектИзменения.ОписаниеИзменений КАК ОписаниеИзменений,
	               |	ТехническийПроектИзменения.НетИзмененийМетаданных КАК НетИзмененийМетаданных,
	               |	ТехническийПроектИзменения.Ключ КАК Ключ
	               |ИЗ
	               |	Документ.ТехническийПроект.Изменения КАК ТехническийПроектИзменения
	               |ГДЕ
	               |	ТехническийПроектИзменения.Ссылка = &Ссылка
	               |ИТОГИ ПО
	               |	Конфигурация.Наименование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТехническийПроектСвойстваОбъекта.Ключ КАК Ключ,
	               |	ТехническийПроектСвойстваОбъекта.Свойство.Наименование КАК Свойство,
	               |	ТехническийПроектСвойстваОбъекта.Значение КАК Значение
	               |ИЗ
	               |	Документ.ТехническийПроект.СвойстваОбъекта КАК ТехническийПроектСвойстваОбъекта
	               |ГДЕ
	               |	ТехническийПроектСвойстваОбъекта.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаТехПроект);
	
	РезультатЗапроса =  Запрос.ВыполнитьПакет();
	
	ШаблонТекстТехПроекта = "<html><head> <style type=""text/css"">
   |TABLE {
   | border-collapse: collapse; /* Убираем двойные линии между ячейками */
   |}
   |TD {
   | border: 0px groove #ccc; /* Рамка вокруг таблицы */
   | padding: 3px; /* Поля вокруг содержимого ячеек */
   |}
   |</style></head><body><P><center><B>%1</B></center></P><P>%2</P><P>%3</P></body></html>";
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаШапка.Следующий();
	ТекстОписание = "<h3>Общее описание</h3>"+СтрЗаменить(ВыборкаШапка.Описание, Символы.ПС, "</BR>");	
	
	ТекстБазы = "";
	//ВыборкаБазы = РезультатЗапроса[1].Выбрать();
	//Пока ВыборкаБазы.Следующий() Цикл
	//	ТекстБазы = ТекстБазы + ?(ТекстБазы= "","","; ") + ВыборкаБазы.КонфигурацияНаименование;
	//КонецЦикла;
	//ТекстБазы = "Базы: "+ТекстБазы;
	
	
	ВыборкаИзмененияК =  РезультатЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаСвойства =  РезультатЗапроса[3].Выгрузить();
	//ШаблонДействиеСОбъектом = "%1.%2";
	ШаблонТаблицы = "<TABLE>%1</TABLE>";
	ШаблонСтроки1 = "<TR><TD colspan = 2>%1</TD></TR>";
	ШаблонСтроки2 = "<TR><TD>%1</TD><TD>%2</TD></TR>";
	ШаблонСтроки3 = "<TR><TD>%1</TD><TD>%2</TD></TR>";
	ШаблонСтроки1и2 = "<TR><TD colspan = 2; style='padding-left:30px'>%2</TD></TR>";
	
	ТекстИзменения = "";
	Пока ВыборкаИзмененияК.Следующий() Цикл
		ВыборкаИзменения = ВыборкаИзмененияК.Выбрать();		
		ТекстИзменения = ТекстИзменения + Символы.ПС + СтрШаблон(ШаблонСтроки1, "<CENTER><B>"+ВыборкаИзмененияК.Конфигурация+"</B></CENTER>");
		Пока ВыборкаИзменения.Следующий() Цикл
			ТекстИзменения = ТекстИзменения + Символы.ПС + СтрШаблон(ШаблонСтроки3, "<B>"+ВыборкаИзменения.Действие+"</B> "+ ВыборкаИзменения.ТипОбъекта+" "+ВыборкаИзменения.Объект, "");
			
			СтрокиСвойства = ТаблицаСвойства.НайтиСтроки(Новый Структура("Ключ",ВыборкаИзменения.Ключ));
			ТекстСвойств = "";
			Для Каждого СтрокаСвойство Из СтрокиСвойства Цикл
				Если НЕ ПустаяСтрока(СтрокаСвойство.Значение) Тогда
					ТекстСвойств = ТекстСвойств + ?(ПустаяСтрока(ТекстСвойств),"","</BR>") + "<i>"+СтрокаСвойство.Свойство+":</i>&nbsp" + СтрокаСвойство.Значение+" ;";	
				КонецЕсли;
			КонецЦикла;
			Если НЕ ПустаяСтрока(ВыборкаИзменения.ОписаниеИзменений) Тогда
				ТекстСвойств = ВыборкаИзменения.ОписаниеИзменений + ?(ПустаяСтрока(ТекстСвойств),"","</BR></BR>"+ ТекстСвойств);
			КонецЕсли;
			Если НЕ ПустаяСтрока(ТекстСвойств) Тогда
				ТекстИзменения = ТекстИзменения + Символы.ПС + СтрШаблон(ШаблонСтроки1и2, "", ТекстСвойств );	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ТекстИзменения = СтрШаблон(ШаблонТаблицы, ТекстИзменения);
		
	ТекстТехПроекта = СтрШаблон(ШаблонТекстТехПроекта, ТекстБазы, ТекстИзменения, ТекстОписание);
	Возврат ТекстТехПроекта;
	
КонецФункции
